Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pio/pic32cz4010ca90208.h
/* ========== Peripheral I/O masks ========== */
#define PORT_PA00                   (_UINT32_(1) << 0) /**< PORT mask for PA00 */
#define PORT_PA01                   (_UINT32_(1) << 1) /**< PORT mask for PA01 */
#define PORT_PA02                   (_UINT32_(1) << 2) /**< PORT mask for PA02 */
#define PORT_PA03                   (_UINT32_(1) << 3) /**< PORT mask for PA03 */
#define PORT_PA04                   (_UINT32_(1) << 4) /**< PORT mask for PA04 */
#define PORT_PA05                   (_UINT32_(1) << 5) /**< PORT mask for PA05 */
#define PORT_PA06                   (_UINT32_(1) << 6) /**< PORT mask for PA06 */
#define PORT_PA07                   (_UINT32_(1) << 7) /**< PORT mask for PA07 */
#define PORT_PA08                   (_UINT32_(1) << 8) /**< PORT mask for PA08 */
#define PORT_PA09                   (_UINT32_(1) << 9) /**< PORT mask for PA09 */
#define PORT_PA10                   (_UINT32_(1) << 10) /**< PORT mask for PA10 */
#define PORT_PA11                   (_UINT32_(1) << 11) /**< PORT mask for PA11 */
#define PORT_PA12                   (_UINT32_(1) << 12) /**< PORT mask for PA12 */
#define PORT_PA13                   (_UINT32_(1) << 13) /**< PORT mask for PA13 */
#define PORT_PA14                   (_UINT32_(1) << 14) /**< PORT mask for PA14 */
#define PORT_PA15                   (_UINT32_(1) << 15) /**< PORT mask for PA15 */
#define PORT_PA16                   (_UINT32_(1) << 16) /**< PORT mask for PA16 */
#define PORT_PA17                   (_UINT32_(1) << 17) /**< PORT mask for PA17 */
#define PORT_PA18                   (_UINT32_(1) << 18) /**< PORT mask for PA18 */
#define PORT_PA19                   (_UINT32_(1) << 19) /**< PORT mask for PA19 */
#define PORT_PA20                   (_UINT32_(1) << 20) /**< PORT mask for PA20 */
#define PORT_PA21                   (_UINT32_(1) << 21) /**< PORT mask for PA21 */
#define PORT_PA22                   (_UINT32_(1) << 22) /**< PORT mask for PA22 */
#define PORT_PA23                   (_UINT32_(1) << 23) /**< PORT mask for PA23 */
#define PORT_PA24                   (_UINT32_(1) << 24) /**< PORT mask for PA24 */
#define PORT_PA25                   (_UINT32_(1) << 25) /**< PORT mask for PA25 */
#define PORT_PA26                   (_UINT32_(1) << 26) /**< PORT mask for PA26 */
#define PORT_PA27                   (_UINT32_(1) << 27) /**< PORT mask for PA27 */
#define PORT_PA28                   (_UINT32_(1) << 28) /**< PORT mask for PA28 */
#define PORT_PA29                   (_UINT32_(1) << 29) /**< PORT mask for PA29 */
#define PORT_PA30                   (_UINT32_(1) << 30) /**< PORT mask for PA30 */
#define PORT_PA31                   (_UINT32_(1) << 31) /**< PORT mask for PA31 */
#define PORT_PB00                   (_UINT32_(1) << 0) /**< PORT mask for PB00 */
#define PORT_PB01                   (_UINT32_(1) << 1) /**< PORT mask for PB01 */
#define PORT_PB02                   (_UINT32_(1) << 2) /**< PORT mask for PB02 */
#define PORT_PB03                   (_UINT32_(1) << 3) /**< PORT mask for PB03 */
#define PORT_PB04                   (_UINT32_(1) << 4) /**< PORT mask for PB04 */
#define PORT_PB05                   (_UINT32_(1) << 5) /**< PORT mask for PB05 */
#define PORT_PB06                   (_UINT32_(1) << 6) /**< PORT mask for PB06 */
#define PORT_PB07                   (_UINT32_(1) << 7) /**< PORT mask for PB07 */
#define PORT_PB08                   (_UINT32_(1) << 8) /**< PORT mask for PB08 */
#define PORT_PB09                   (_UINT32_(1) << 9) /**< PORT mask for PB09 */
#define PORT_PB10                   (_UINT32_(1) << 10) /**< PORT mask for PB10 */
#define PORT_PB11                   (_UINT32_(1) << 11) /**< PORT mask for PB11 */
#define PORT_PB12                   (_UINT32_(1) << 12) /**< PORT mask for PB12 */
#define PORT_PB13                   (_UINT32_(1) << 13) /**< PORT mask for PB13 */
#define PORT_PB14                   (_UINT32_(1) << 14) /**< PORT mask for PB14 */
#define PORT_PB15                   (_UINT32_(1) << 15) /**< PORT mask for PB15 */
#define PORT_PB16                   (_UINT32_(1) << 16) /**< PORT mask for PB16 */
#define PORT_PB17                   (_UINT32_(1) << 17) /**< PORT mask for PB17 */
#define PORT_PB18                   (_UINT32_(1) << 18) /**< PORT mask for PB18 */
#define PORT_PB19                   (_UINT32_(1) << 19) /**< PORT mask for PB19 */
#define PORT_PB20                   (_UINT32_(1) << 20) /**< PORT mask for PB20 */
#define PORT_PB21                   (_UINT32_(1) << 21) /**< PORT mask for PB21 */
#define PORT_PB22                   (_UINT32_(1) << 22) /**< PORT mask for PB22 */
#define PORT_PB23                   (_UINT32_(1) << 23) /**< PORT mask for PB23 */
#define PORT_PB24                   (_UINT32_(1) << 24) /**< PORT mask for PB24 */
#define PORT_PB25                   (_UINT32_(1) << 25) /**< PORT mask for PB25 */
#define PORT_PB26                   (_UINT32_(1) << 26) /**< PORT mask for PB26 */
#define PORT_PB27                   (_UINT32_(1) << 27) /**< PORT mask for PB27 */
#define PORT_PB28                   (_UINT32_(1) << 28) /**< PORT mask for PB28 */
#define PORT_PB29                   (_UINT32_(1) << 29) /**< PORT mask for PB29 */
#define PORT_PB30                   (_UINT32_(1) << 30) /**< PORT mask for PB30 */
#define PORT_PB31                   (_UINT32_(1) << 31) /**< PORT mask for PB31 */
#define PORT_PC00                   (_UINT32_(1) << 0) /**< PORT mask for PC00 */
#define PORT_PC01                   (_UINT32_(1) << 1) /**< PORT mask for PC01 */
#define PORT_PC02                   (_UINT32_(1) << 2) /**< PORT mask for PC02 */
#define PORT_PC03                   (_UINT32_(1) << 3) /**< PORT mask for PC03 */
#define PORT_PC04                   (_UINT32_(1) << 4) /**< PORT mask for PC04 */
#define PORT_PC05                   (_UINT32_(1) << 5) /**< PORT mask for PC05 */
#define PORT_PC06                   (_UINT32_(1) << 6) /**< PORT mask for PC06 */
#define PORT_PC07                   (_UINT32_(1) << 7) /**< PORT mask for PC07 */
#define PORT_PC08                   (_UINT32_(1) << 8) /**< PORT mask for PC08 */
#define PORT_PC09                   (_UINT32_(1) << 9) /**< PORT mask for PC09 */
#define PORT_PC10                   (_UINT32_(1) << 10) /**< PORT mask for PC10 */
#define PORT_PC11                   (_UINT32_(1) << 11) /**< PORT mask for PC11 */
#define PORT_PC12                   (_UINT32_(1) << 12) /**< PORT mask for PC12 */
#define PORT_PC13                   (_UINT32_(1) << 13) /**< PORT mask for PC13 */
#define PORT_PC14                   (_UINT32_(1) << 14) /**< PORT mask for PC14 */
#define PORT_PC15                   (_UINT32_(1) << 15) /**< PORT mask for PC15 */
#define PORT_PC17                   (_UINT32_(1) << 17) /**< PORT mask for PC17 */
#define PORT_PC18                   (_UINT32_(1) << 18) /**< PORT mask for PC18 */
#define PORT_PC19                   (_UINT32_(1) << 19) /**< PORT mask for PC19 */
#define PORT_PC20                   (_UINT32_(1) << 20) /**< PORT mask for PC20 */
#define PORT_PC21                   (_UINT32_(1) << 21) /**< PORT mask for PC21 */
#define PORT_PC22                   (_UINT32_(1) << 22) /**< PORT mask for PC22 */
#define PORT_PC23                   (_UINT32_(1) << 23) /**< PORT mask for PC23 */
#define PORT_PC24                   (_UINT32_(1) << 24) /**< PORT mask for PC24 */
#define PORT_PC25                   (_UINT32_(1) << 25) /**< PORT mask for PC25 */
#define PORT_PC26                   (_UINT32_(1) << 26) /**< PORT mask for PC26 */
#define PORT_PC27                   (_UINT32_(1) << 27) /**< PORT mask for PC27 */
#define PORT_PC28                   (_UINT32_(1) << 28) /**< PORT mask for PC28 */
#define PORT_PC29                   (_UINT32_(1) << 29) /**< PORT mask for PC29 */
#define PORT_PC30                   (_UINT32_(1) << 30) /**< PORT mask for PC30 */
#define PORT_PC31                   (_UINT32_(1) << 31) /**< PORT mask for PC31 */
#define PORT_PD00                   (_UINT32_(1) << 0) /**< PORT mask for PD00 */
#define PORT_PD01                   (_UINT32_(1) << 1) /**< PORT mask for PD01 */
#define PORT_PD02                   (_UINT32_(1) << 2) /**< PORT mask for PD02 */
#define PORT_PD03                   (_UINT32_(1) << 3) /**< PORT mask for PD03 */
#define PORT_PD04                   (_UINT32_(1) << 4) /**< PORT mask for PD04 */
#define PORT_PD05                   (_UINT32_(1) << 5) /**< PORT mask for PD05 */
#define PORT_PD06                   (_UINT32_(1) << 6) /**< PORT mask for PD06 */
#define PORT_PD07                   (_UINT32_(1) << 7) /**< PORT mask for PD07 */
#define PORT_PD08                   (_UINT32_(1) << 8) /**< PORT mask for PD08 */
#define PORT_PD09                   (_UINT32_(1) << 9) /**< PORT mask for PD09 */
#define PORT_PD10                   (_UINT32_(1) << 10) /**< PORT mask for PD10 */
#define PORT_PD11                   (_UINT32_(1) << 11) /**< PORT mask for PD11 */
#define PORT_PD12                   (_UINT32_(1) << 12) /**< PORT mask for PD12 */
#define PORT_PD13                   (_UINT32_(1) << 13) /**< PORT mask for PD13 */
#define PORT_PD14                   (_UINT32_(1) << 14) /**< PORT mask for PD14 */
#define PORT_PD15                   (_UINT32_(1) << 15) /**< PORT mask for PD15 */
#define PORT_PD16                   (_UINT32_(1) << 16) /**< PORT mask for PD16 */
#define PORT_PD17                   (_UINT32_(1) << 17) /**< PORT mask for PD17 */
#define PORT_PD18                   (_UINT32_(1) << 18) /**< PORT mask for PD18 */
#define PORT_PD19                   (_UINT32_(1) << 19) /**< PORT mask for PD19 */
#define PORT_PD20                   (_UINT32_(1) << 20) /**< PORT mask for PD20 */
#define PORT_PD21                   (_UINT32_(1) << 21) /**< PORT mask for PD21 */
#define PORT_PD23                   (_UINT32_(1) << 23) /**< PORT mask for PD23 */
#define PORT_PD24                   (_UINT32_(1) << 24) /**< PORT mask for PD24 */
#define PORT_PD25                   (_UINT32_(1) << 25) /**< PORT mask for PD25 */
#define PORT_PD26                   (_UINT32_(1) << 26) /**< PORT mask for PD26 */
#define PORT_PD27                   (_UINT32_(1) << 27) /**< PORT mask for PD27 */
#define PORT_PD28                   (_UINT32_(1) << 28) /**< PORT mask for PD28 */
#define PORT_PD29                   (_UINT32_(1) << 29) /**< PORT mask for PD29 */
#define PORT_PE00                   (_UINT32_(1) << 0) /**< PORT mask for PE00 */
#define PORT_PE01                   (_UINT32_(1) << 1) /**< PORT mask for PE01 */
#define PORT_PE02                   (_UINT32_(1) << 2) /**< PORT mask for PE02 */
#define PORT_PE03                   (_UINT32_(1) << 3) /**< PORT mask for PE03 */
#define PORT_PE04                   (_UINT32_(1) << 4) /**< PORT mask for PE04 */
#define PORT_PE05                   (_UINT32_(1) << 5) /**< PORT mask for PE05 */
#define PORT_PE06                   (_UINT32_(1) << 6) /**< PORT mask for PE06 */
#define PORT_PE07                   (_UINT32_(1) << 7) /**< PORT mask for PE07 */
#define PORT_PE08                   (_UINT32_(1) << 8) /**< PORT mask for PE08 */
#define PORT_PE09                   (_UINT32_(1) << 9) /**< PORT mask for PE09 */
#define PORT_PE10                   (_UINT32_(1) << 10) /**< PORT mask for PE10 */
#define PORT_PE11                   (_UINT32_(1) << 11) /**< PORT mask for PE11 */
#define PORT_PF00                   (_UINT32_(1) << 0) /**< PORT mask for PF00 */
#define PORT_PF01                   (_UINT32_(1) << 1) /**< PORT mask for PF01 */
#define PORT_PF02                   (_UINT32_(1) << 2) /**< PORT mask for PF02 */
#define PORT_PF03                   (_UINT32_(1) << 3) /**< PORT mask for PF03 */
#define PORT_PF04                   (_UINT32_(1) << 4) /**< PORT mask for PF04 */
#define PORT_PF05                   (_UINT32_(1) << 5) /**< PORT mask for PF05 */
#define PORT_PF06                   (_UINT32_(1) << 6) /**< PORT mask for PF06 */
#define PORT_PF07                   (_UINT32_(1) << 7) /**< PORT mask for PF07 */
#define PORT_PF08                   (_UINT32_(1) << 8) /**< PORT mask for PF08 */
#define PORT_PG00                   (_UINT32_(1) << 0) /**< PORT mask for PG00 */
#define PORT_PG01                   (_UINT32_(1) << 1) /**< PORT mask for PG01 */
#define PORT_PG02                   (_UINT32_(1) << 2) /**< PORT mask for PG02 */
#define PORT_PG03                   (_UINT32_(1) << 3) /**< PORT mask for PG03 */
#define PORT_PG04                   (_UINT32_(1) << 4) /**< PORT mask for PG04 */
#define PORT_PG05                   (_UINT32_(1) << 5) /**< PORT mask for PG05 */
#define PORT_PG06                   (_UINT32_(1) << 6) /**< PORT mask for PG06 */
#define PORT_PG07                   (_UINT32_(1) << 7) /**< PORT mask for PG07 */
#define PORT_PG08                   (_UINT32_(1) << 8) /**< PORT mask for PG08 */
#define PORT_PG09                   (_UINT32_(1) << 9) /**< PORT mask for PG09 */
#define PORT_PG10                   (_UINT32_(1) << 10) /**< PORT mask for PG10 */
#define PORT_PG11                   (_UINT32_(1) << 11) /**< PORT mask for PG11 */

/* ========== PORT definition for AC peripheral ========== */
#define PIN_PB01B_AC_AIN0                          _UINT32_(33)
#define MUX_PB01B_AC_AIN0                          _UINT32_(1) 
#define PINMUX_PB01B_AC_AIN0                       ((PIN_PB01B_AC_AIN0 << 16) | MUX_PB01B_AC_AIN0)
#define PORT_PB01B_AC_AIN0                         (_UINT32_(1) << 1)

#define PIN_PB00B_AC_AIN1                          _UINT32_(32)
#define MUX_PB00B_AC_AIN1                          _UINT32_(1) 
#define PINMUX_PB00B_AC_AIN1                       ((PIN_PB00B_AC_AIN1 << 16) | MUX_PB00B_AC_AIN1)
#define PORT_PB00B_AC_AIN1                         (_UINT32_(1) << 0)

