Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pio/pic32cz4010ca90208.h
/* ========== PORT definition for EBI peripheral ========== */
#define PIN_PC19E_EBI_A2                           _UINT32_(83)
#define MUX_PC19E_EBI_A2                           _UINT32_(4) 
#define PINMUX_PC19E_EBI_A2                        ((PIN_PC19E_EBI_A2 << 16) | MUX_PC19E_EBI_A2)
#define PORT_PC19E_EBI_A2                          (_UINT32_(1) << 19)

#define PIN_PC18E_EBI_A3                           _UINT32_(82)
#define MUX_PC18E_EBI_A3                           _UINT32_(4) 
#define PINMUX_PC18E_EBI_A3                        ((PIN_PC18E_EBI_A3 << 16) | MUX_PC18E_EBI_A3)
#define PORT_PC18E_EBI_A3                          (_UINT32_(1) << 18)

#define PIN_PC17E_EBI_A4                           _UINT32_(81)
#define MUX_PC17E_EBI_A4                           _UINT32_(4) 
#define PINMUX_PC17E_EBI_A4                        ((PIN_PC17E_EBI_A4 << 16) | MUX_PC17E_EBI_A4)
#define PORT_PC17E_EBI_A4                          (_UINT32_(1) << 17)

#define PIN_PC15E_EBI_A5                           _UINT32_(79)
#define MUX_PC15E_EBI_A5                           _UINT32_(4) 
#define PINMUX_PC15E_EBI_A5                        ((PIN_PC15E_EBI_A5 << 16) | MUX_PC15E_EBI_A5)
#define PORT_PC15E_EBI_A5                          (_UINT32_(1) << 15)

#define PIN_PC14E_EBI_A6                           _UINT32_(78)
#define MUX_PC14E_EBI_A6                           _UINT32_(4) 
#define PINMUX_PC14E_EBI_A6                        ((PIN_PC14E_EBI_A6 << 16) | MUX_PC14E_EBI_A6)
#define PORT_PC14E_EBI_A6                          (_UINT32_(1) << 14)

#define PIN_PC29E_EBI_A7                           _UINT32_(93)
#define MUX_PC29E_EBI_A7                           _UINT32_(4) 
#define PINMUX_PC29E_EBI_A7                        ((PIN_PC29E_EBI_A7 << 16) | MUX_PC29E_EBI_A7)
#define PORT_PC29E_EBI_A7                          (_UINT32_(1) << 29)

#define PIN_PC13E_EBI_A8                           _UINT32_(77)
#define MUX_PC13E_EBI_A8                           _UINT32_(4) 
#define PINMUX_PC13E_EBI_A8                        ((PIN_PC13E_EBI_A8 << 16) | MUX_PC13E_EBI_A8)
#define PORT_PC13E_EBI_A8                          (_UINT32_(1) << 13)

#define PIN_PC12E_EBI_A9                           _UINT32_(76)
#define MUX_PC12E_EBI_A9                           _UINT32_(4) 
#define PINMUX_PC12E_EBI_A9                        ((PIN_PC12E_EBI_A9 << 16) | MUX_PC12E_EBI_A9)
#define PORT_PC12E_EBI_A9                          (_UINT32_(1) << 12)

#define PIN_PC28E_EBI_A10                          _UINT32_(92)
#define MUX_PC28E_EBI_A10                          _UINT32_(4) 
#define PINMUX_PC28E_EBI_A10                       ((PIN_PC28E_EBI_A10 << 16) | MUX_PC28E_EBI_A10)
#define PORT_PC28E_EBI_A10                         (_UINT32_(1) << 28)

#define PIN_PG03E_EBI_A11                          _UINT32_(195)
#define MUX_PG03E_EBI_A11                          _UINT32_(4) 
#define PINMUX_PG03E_EBI_A11                       ((PIN_PG03E_EBI_A11 << 16) | MUX_PG03E_EBI_A11)
#define PORT_PG03E_EBI_A11                         (_UINT32_(1) << 3)

#define PIN_PC27E_EBI_A12                          _UINT32_(91)
#define MUX_PC27E_EBI_A12                          _UINT32_(4) 
#define PINMUX_PC27E_EBI_A12                       ((PIN_PC27E_EBI_A12 << 16) | MUX_PC27E_EBI_A12)
#define PORT_PC27E_EBI_A12                         (_UINT32_(1) << 27)

#define PIN_PC11E_EBI_A13                          _UINT32_(75)
#define MUX_PC11E_EBI_A13                          _UINT32_(4) 
#define PINMUX_PC11E_EBI_A13                       ((PIN_PC11E_EBI_A13 << 16) | MUX_PC11E_EBI_A13)
#define PORT_PC11E_EBI_A13                         (_UINT32_(1) << 11)

#define PIN_PC10E_EBI_A14                          _UINT32_(74)
#define MUX_PC10E_EBI_A14                          _UINT32_(4) 
#define PINMUX_PC10E_EBI_A14                       ((PIN_PC10E_EBI_A14 << 16) | MUX_PC10E_EBI_A14)
#define PORT_PC10E_EBI_A14                         (_UINT32_(1) << 10)

#define PIN_PG02E_EBI_A15                          _UINT32_(194)
#define MUX_PG02E_EBI_A15                          _UINT32_(4) 
#define PINMUX_PG02E_EBI_A15                       ((PIN_PG02E_EBI_A15 << 16) | MUX_PG02E_EBI_A15)
#define PORT_PG02E_EBI_A15                         (_UINT32_(1) << 2)

#define PIN_PG01E_EBI_A16                          _UINT32_(193)
#define MUX_PG01E_EBI_A16                          _UINT32_(4) 
#define PINMUX_PG01E_EBI_A16                       ((PIN_PG01E_EBI_A16 << 16) | MUX_PG01E_EBI_A16)
#define PORT_PG01E_EBI_A16                         (_UINT32_(1) << 1)

#define PIN_PG00E_EBI_A17                          _UINT32_(192)
#define MUX_PG00E_EBI_A17                          _UINT32_(4) 
#define PINMUX_PG00E_EBI_A17                       ((PIN_PG00E_EBI_A17 << 16) | MUX_PG00E_EBI_A17)
#define PORT_PG00E_EBI_A17                         (_UINT32_(1) << 0)

#define PIN_PC26E_EBI_A18                          _UINT32_(90)
#define MUX_PC26E_EBI_A18                          _UINT32_(4) 
#define PINMUX_PC26E_EBI_A18                       ((PIN_PC26E_EBI_A18 << 16) | MUX_PC26E_EBI_A18)
#define PORT_PC26E_EBI_A18                         (_UINT32_(1) << 26)

#define PIN_PC31E_EBI_A19                          _UINT32_(95)
#define MUX_PC31E_EBI_A19                          _UINT32_(4) 
#define PINMUX_PC31E_EBI_A19                       ((PIN_PC31E_EBI_A19 << 16) | MUX_PC31E_EBI_A19)
#define PORT_PC31E_EBI_A19                         (_UINT32_(1) << 31)

#define PIN_PC30E_EBI_A20                          _UINT32_(94)
#define MUX_PC30E_EBI_A20                          _UINT32_(4) 
#define PINMUX_PC30E_EBI_A20                       ((PIN_PC30E_EBI_A20 << 16) | MUX_PC30E_EBI_A20)
#define PORT_PC30E_EBI_A20                         (_UINT32_(1) << 30)

#define PIN_PC25E_EBI_A21                          _UINT32_(89)
#define MUX_PC25E_EBI_A21                          _UINT32_(4) 
#define PINMUX_PC25E_EBI_A21                       ((PIN_PC25E_EBI_A21 << 16) | MUX_PC25E_EBI_A21)
#define PORT_PC25E_EBI_A21                         (_UINT32_(1) << 25)

#define PIN_PC09E_EBI_A22                          _UINT32_(73)
#define MUX_PC09E_EBI_A22                          _UINT32_(4) 
#define PINMUX_PC09E_EBI_A22                       ((PIN_PC09E_EBI_A22 << 16) | MUX_PC09E_EBI_A22)
#define PORT_PC09E_EBI_A22                         (_UINT32_(1) << 9)

